Documents/ЛБ_ИнвентаризацияОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ИнвентаризацияОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МОЛы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнвентаризационнаяКомиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Председатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дистанционно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_ИнвентаризацияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ИнвентаризацияДС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ИнициаторыИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУчетная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаФактическая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МОЛы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнвентаризационнаяКомиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Председатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дистанционно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_ИнвентаризацияОтходовДМ/Ext/ManagerModule.bsl
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "АктНаличныхДС";
	//КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации наличных ДС'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	//ВалютаРегламентированногоУчета = Справочники.Валюты.НайтиПоКоду("643");
	//
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОтходовДМ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктОтходовДМ",  "Акт инвентаризации отходов ДМ", 
		ПечатьАктаОтходовДМ(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_ИнвентаризацияОтходовДМ.АктОтходовДМ");
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПустойАкт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПустойАкт",  "Пустой акт инвентаризации отходов ДМ", 
		ПечатьПустойАкт(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_ИнвентаризацияОтходовДМ.ПустойАкт");
	КонецЕсли;

КонецПроцедуры  

Функция ПечатьАктаОтходовДМ(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
    ТабДокумент.ТолькоПросмотр = Истина;
	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		Выборка = ПолучитьДанныеДокумента(Док);		
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ИнвентаризацияОтходовДМ.АктИнвентаризацииОтходов");
		
		Пока Выборка.Следующий() Цикл
			
			//Найдем все данные для последующего заполнения
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			ЧленКомиссии = Выборка.ИнвентаризационнаяКомиссия.Выбрать();  
			
			Молы = Выборка.Молы.Выбрать();  
			МолыПодвал = Выборка.Молы.Выбрать();  

			//Приступаем к заполнению			
			ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакетаШапка.Параметры.Заполнить(Выборка);      
			ОбластьМакетаШапка.Параметры.ДатаСоставления = Формат(Выборка.ДатаСоставления, "ДФ=dd.MM.yyyy");
			ОбластьМакетаШапка.Параметры.ДокументОснованиеДата = Формат(Выборка.ДокументОснованиеДата, "ДФ=dd.MM.yyyy");
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			
			ОбластьМакетаШапкаМОЛ = Макет.ПолучитьОбласть("ШапкаМОЛ");
			
			Нпп = 1;
			Пока Молы.Следующий() Цикл
				Если Нпп = 1 Тогда
					ОбластьМакетаШапкаМОЛ.Параметры.МОЛ = "Материально ответственное(ые) лицо(а)";
				Иначе
					ОбластьМакетаШапкаМОЛ.Параметры.МОЛ = "";
				КонецЕсли;
				ОбластьМакетаШапкаМОЛ.Параметры.КассирДолжность = Молы.Физлицо.Должность;
				ОбластьМакетаШапкаМОЛ.Параметры.ФИОКассира = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Молы.ФизЛицо.ФизическоеЛицо.Наименование);
				ТабДокумент.Вывести(ОбластьМакетаШапкаМОЛ); 
				Нпп = Нпп + 1;
			КонецЦикла;    

			ОбластьМакетаТело = Макет.ПолучитьОбласть("Тело"); 
			//ОбластьМакетаТело.Параметры.Заполнить(Выборка);      
			ОбластьМакетаТело.Параметры.ДатаСоставления = Формат(Выборка.ДатаСоставления, "ДЛФ=DD");
			ОбластьМакетаТело.Параметры.УчБрутто = Формат(Выборка.УчБрутто, "ЧДЦ=2");
			ОбластьМакетаТело.Параметры.УчНетто = Формат(Выборка.УчНетто, "ЧДЦ=2");
			ОбластьМакетаТело.Параметры.ФактБрутто = Формат(Выборка.ФактБрутто, "ЧДЦ=2");
			ОбластьМакетаТело.Параметры.ФактНетто = Формат(Выборка.ФактНетто, "ЧДЦ=2");
			ТабДокумент.Вывести(ОбластьМакетаТело);

			ОбластьМакетаКомиссия = Макет.ПолучитьОбласть("ЧленыКомиссии");
			
			
			Инд = 1;
			Пока ЧленКомиссии.Следующий() Цикл
				Если ЧленКомиссии.Председатель Тогда
					ОбластьМакетаКомиссия.Параметры["ЗаголовокЧленаКомиссии"] = "Председатель комиссии";
					ОбластьМакетаКомиссия.Параметры["Должность"] = ЧленКомиссии.ФизЛицо.Должность;
					ОбластьМакетаКомиссия.Параметры["НаименованиеЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.ФизическоеЛицо.Наименование);
					ТабДокумент.Вывести(ОбластьМакетаКомиссия); 
				КонецЕсли;
			КонецЦикла;
			
			инд = 0;
			ЧленКомиссии = Выборка.ИнвентаризационнаяКомиссия.Выбрать();   
			Пока ЧленКомиссии.Следующий() Цикл 
				Если инд < 3 Тогда
					Если НЕ ЧленКомиссии.Председатель Тогда 				
						Если инд = 0 Тогда
							ОбластьМакетаКомиссия.Параметры["ЗаголовокЧленаКомиссии"] = "Члены комиссии";
						Иначе
							ОбластьМакетаКомиссия.Параметры["ЗаголовокЧленаКомиссии"] = "";
						КонецЕсли;
						ОбластьМакетаКомиссия.Параметры["Должность"] = ЧленКомиссии.ФизЛицо.Должность;
						ОбластьМакетаКомиссия.Параметры["НаименованиеЧленаКомиссии"] = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧленКомиссии.ФизЛицо.ФизическоеЛицо.Наименование);
						ТабДокумент.Вывести(ОбластьМакетаКомиссия);  
						инд = инд + 1;   				
					КонецЕсли; 
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
			ТабДокумент.Вывести(ОбластьМакетаПодвал);
			
			ОбластьМакетаПодвалМОЛ = Макет.ПолучитьОбласть("ПодвалМОЛ");
			
			Нпп = 1;
			Пока МолыПодвал.Следующий() Цикл
				Если Нпп = 1 Тогда
					ОбластьМакетаПодвалМОЛ.Параметры.МОЛ = "Материально ответственное(ые) лицо(а)";
				Иначе
					ОбластьМакетаПодвалМОЛ.Параметры.МОЛ = "";
				КонецЕсли;
				ОбластьМакетаПодвалМОЛ.Параметры.КассирДолжность = МолыПодвал.Физлицо.Должность;
				ОбластьМакетаПодвалМОЛ.Параметры.ФИОКассира = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(МолыПодвал.ФИзлицо.ФизическоеЛицо.Наименование);
				ТабДокумент.Вывести(ОбластьМакетаПодвалМОЛ);
				Нпп = Нпп + 1;
			КонецЦикла;    
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьДанныеДокумента(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЛБ_ИнвентаризацияОтходовДМ.Ссылка КАК Ссылка,
					|	ЛБ_ИнвентаризацияОтходовДМ.Номер КАК НомерДокумента,
					|	ЛБ_ИнвентаризацияОтходовДМ.Дата КАК ДатаСоставления,
					|	ЛБ_ИнвентаризацияОтходовДМ.НомерПриказа КАК ДокументОснованиеНомер,
					|	ЛБ_ИнвентаризацияОтходовДМ.ДатаПриказа КАК ДокументОснованиеДата,
					|	ЛБ_ИнвентаризацияОтходовДМ.Ответственный КАК Ответственный,
					|	ЛБ_ИнвентаризацияОтходовДМ.Организация КАК Организация,
					|	ЛБ_ИнвентаризацияОтходовДМ.Ломбард КАК Подразделение,
					|	ЛБ_ИнвентаризацияОтходовДМ.ИнвентаризационнаяКомиссия.(
					|		Ссылка КАК Ссылка,
					|		НомерСтроки КАК НомерСтроки,
					|		ФизЛицо КАК ФизЛицо,
					|		Председатель КАК Председатель,
					|		Дистанционно КАК Дистанционно
					|	) КАК ИнвентаризационнаяКомиссия,
					|	ЛБ_ИнвентаризацияОтходовДМ.МОЛы.(
					|		Ссылка КАК Ссылка,
					|		НомерСтроки КАК НомерСтроки,
					|		ФизЛицо КАК ФизЛицо
					|	) КАК МОЛы,
					|	ЛБ_ИнвентаризацияОтходовДМ.УчБрутто КАК УчБрутто,
					|	ЛБ_ИнвентаризацияОтходовДМ.УчНетто КАК УчНетто,
					|	ЛБ_ИнвентаризацияОтходовДМ.ФактБрутто КАК ФактБрутто,
					|	ЛБ_ИнвентаризацияОтходовДМ.ФактНетто КАК ФактНетто
					|ИЗ
					|	Документ.ЛБ_ИнвентаризацияОтходовДМ КАК ЛБ_ИнвентаризацияОтходовДМ
					|ГДЕ
					|	ЛБ_ИнвентаризацияОтходовДМ.Ссылка В(&МассивОбъектов)";

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПечатьПустойАкт(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	ПервыйДокумент = Истина;

	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ИнвентаризацияОтходовДМ.АктИнвентаризацииОтходовПустой");
		
		//Найдем все данные для последующего заполнения
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		//Приступаем к заполнению			
		ОбластьМакетаСтр = Макет.ПолучитьОбласть("Страница");
		//ОбластьМакетаСтр1.Параметры.Организация 	= Док.Организация;
		
		Ломбард = МассивОбъектов[0].Ломбард; //ПолучитьЛомбард(Пользователи.ТекущийПользователь());
		
		Если Ломбард <> Неопределено Тогда
			ОбластьМакетаСтр.Параметры.Подразделение = Ломбард;
		Иначе
			//Сообщить("Невыбран ломбард пользователя");
			ОбластьМакетаСтр.Параметры.Подразделение = "Невыбран ломбард пользователя";
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакетаСтр);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Документы.ЛБ_ИнвентаризацияДС.ПустаяСсылка()); //Док);
		
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

//Функция ПолучитьЛомбард(Пользователь)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЛБ_ТекущийЛомбардПользователя.Ломбард КАК Ломбард
//		|ИЗ
//		|	РегистрСведений.ЛБ_ТекущийЛомбардПользователя КАК ЛБ_ТекущийЛомбардПользователя
//		|ГДЕ
//		|	ЛБ_ТекущийЛомбардПользователя.Пользователь = &Пользователь";
//	
//	Запрос.УстановитьПараметр("Пользователь", Пользователь);
//	
//	Результат = Запрос.Выполнить().Выбрать();
//	
//	Если Результат.Следующий() Тогда
//		Возврат Результат.Ломбард;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции
